#+TITLE: April 11, 2017 - April 26, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                           | CANCELED |
|------+------+-------------+---------+----------------------------------------------------------------+----------|
|      |      |             |         | KERNEL.1492076921. Linux Device Drivers, 3rd edit (2017-04-25) |          |
|      |      |             |         | KERNEL.1489241685. Test suite for shakthimaan Lin (2017-04-18) |          |
|      |      |             |         | KERNEL.1489242032. [PR-1] Review and merge for Li (2017-04-17) |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Mbuf   |       0.5 |   0.75 |  0.5 |         0 |   2017-04-25 | ########## |
| Mpduty |      24.0 |   22.7 | 24.0 |         0 |   2017-04-25 | ########## |
| Imack  |         0 |      0 |    0 |         0 |   2017-04-25 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  25 ++--###########################----+--------+--------+-------+-------++   
:     |   ....                       #                                      |   
:     |       .                       #                      ACTUAL ####### |   
:     |        ....                   #                       IDEAL ....... |   
:  20 ++           .....               #                                   ++   
:     |                 ....           #                                    |   
:     |                     ....        #                                   |   
:  15 ++                        .....   #                                  ++   
:     |                              ....#                                  |   
:     |                                  ###########################        |   
:     |                                      ....                   #       |   
:  10 ++                                         .                  #      ++   
:     |                                           ........           #      |   
:     |                                                   .          #      |   
:   5 ++                                                   .......    #    ++   
:     |                                                           .   #     |   
:     |                                                            ....#    |   
:     |                                                                #....|   
:   0 ++-------+--------+-------+--------+--------+--------+-------+----#--+.   
:     0        2        4       6        8        10       12      14       16  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:16]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED   |
|-----+------------+--------+-------+-------------------|
|   1 | 2017-04-11 |   24.5 |    23 |                   |
|   2 | 2017-04-12 |   24.5 |    21 |                   |
|   3 | 2017-04-13 |   24.5 |    20 |                   |
|   4 | 2017-04-14 |   24.5 |    18 |                   |
|   5 | 2017-04-15 |   24.5 |    17 |                   |
|   6 | 2017-04-16 |   24.5 |    15 |                   |
|   7 | 2017-04-17 |   24.0 |    14 | KERNEL.1489242032 |
|   8 | 2017-04-18 |   12.0 |    12 | KERNEL.1489241685 |
|   9 | 2017-04-19 |   12.0 |    11 |                   |
|  10 | 2017-04-20 |   12.0 |     9 |                   |
|  11 | 2017-04-21 |   12.0 |     8 |                   |
|  12 | 2017-04-22 |   12.0 |     6 |                   |
|  13 | 2017-04-23 |   12.0 |     5 |                   |
|  14 | 2017-04-24 |   12.0 |     3 |                   |
|  15 | 2017-04-25 |    0.0 |     2 | KERNEL.1492076921 |
|  16 | 2017-04-26 |        |     0 |                   |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                 | TASKID            | OWNER  | PRIORITY | TODO | ESTIMATED | ACTUAL |
|----------------------------------------------------------------------+-------------------+--------+----------+------+-----------+--------|
| * TASKS                                                              |                   |        | B        |      |      24.5 |  23.45 |
|----------------------------------------------------------------------+-------------------+--------+----------+------+-----------+--------|
| ** KERNEL                                                            |                   |        | B        |      |      24.5 |  23.45 |
| *** Linux Device Drivers, 3rd edition, Part IV [6/6]                 | KERNEL.1492076921 | mpduty | B        | DONE |      12.0 |   18.9 |
| *** Test suite for shakthimaan Linux device driver code examples III | KERNEL.1489241685 | mpduty | B        | DONE |      12.0 |    3.8 |
| *** [PR-1] Review and merge for Linux device driver code examples    | KERNEL.1489242032 | mbuf   | B        | DONE |       0.5 |   0.75 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2017-04-11 Tue>
  :wpd-imack:       2
  :wpd-mpduty:      2
  :wpd-mbuf:      1
  :END:
** KERNEL
*** DONE Linux Device Drivers, 3rd edition, Part IV [6/6]
    CLOSED: [2017-04-25 Tue 15:23]
    :PROPERTIES:
    :ESTIMATED: 12.0
    :ACTUAL: 18.9
    :OWNER: mpduty
    :ID: KERNEL.1492076921
    :TASKID: KERNEL.1492076921
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-21 Fri 20:15]--[2017-04-21 Fri 22:20] =>  2:05
    CLOCK: [2017-04-20 Thu 07:25]--[2017-04-20 Thu 09:50] =>  2:25
    CLOCK: [2017-04-19 Wed 21:10]--[2017-04-19 Wed 22:35] =>  1:25
    CLOCK: [2017-04-19 Wed 07:55]--[2017-04-19 Wed 10:10] =>  2:15
    CLOCK: [2017-04-15 Sat 07:40]--[2017-04-15 Sat 10:20] =>  2:40
    CLOCK: [2017-04-14 Fri 22:10]--[2017-04-14 Fri 23:50] =>  1:40
    CLOCK: [2017-04-13 Thu 21:25]--[2017-04-13 Thu 23:35] =>  2:10
    CLOCK: [2017-04-12 Wed 21:10]--[2017-04-12 Wed 22:55] =>  1:45
    CLOCK: [2017-04-11 Tue 08:45]--[2017-04-11 Tue 10:10] =>  1:25
    CLOCK: [2017-04-10 Mon 09:10]--[2017-04-10 Mon 10:15] =>  1:05
    :END:
    - [X] Chapter 13: USB Drivers
    - [X] Chapter 14: The Linux Device Model
    - [X] Chapter 15: Memory Mapping and DMA
    - [X] Chapter 16: Block Drivers
    - [X] Chapter 17: Network Drivers
    - [X] Chapter 18: TTY Drivers
*** DONE Test suite for shakthimaan Linux device driver code examples III
    CLOSED: [2017-04-18 Tue 20:00]
    :PROPERTIES:
    :ESTIMATED: 12.0
    :ACTUAL: 3.8
    :OWNER: mpduty
    :ID: KERNEL.1489241685
    :TASKID: KERNEL.1489241685
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-17 Mon 14:25]--[2017-04-17 Mon 14:40] =>  0:15
    CLOCK: [2017-04-13 Thu 13:20]--[2017-04-13 Thu 14:05] =>  0:45
    CLOCK: [2017-04-12 Wed 13:15]--[2017-04-12 Wed 14:55] =>  1:40
    CLOCK: [2017-04-11 Tue 13:40]--[2017-04-18 Tue 20:00] => 174:20
    :END:
*** DONE [PR-1] Review and merge for Linux device driver code examples
    CLOSED: [2017-04-17 Mon 14:41]
    :PROPERTIES:
    :ESTIMATED: 0.5
    :ACTUAL: 0.75
    :OWNER: mbuf
    :ID: KERNEL.1489242032
    :TASKID: KERNEL.1489242032
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-13 Thu 17:00]--[2017-04-13 Thu 17:30] =>  0:30
    :END:
    Source: https://github.com/shakthimaan/linux-device-driver-examples/pull/1

